{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "filters": 20, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 20, 20, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "filters": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "filters": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 500, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "dtype": "float32", "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 26, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "trainable": true, "dtype": "float32", "use_bias": true, "kernel_constraint": null}}], "name": "sequential_1"}}